const housesData = [
    // ===== ЖКО "ЮГ" =====
    {
        street: "ул. Советская",
        houses: [
            "1","3","4","5","6","7","8","10","12","14","16","18","19","20","21","22","23","24","25","26","28","29","30","32","32а","33","34","35","35а","36","36а","37","37а","38","39","40","41а","42","43","44","45","46"
        ].map(num => ({ number: num, documents: [] })), // преобразуем строки в объекты
        jko: "Юг",
        jkoAddress: "г. Электрогорск, ул. Советская д. 7",
        jkoPhone: "8 (49643) 3-21-85",
        jkoChief: "Назарова Маргарита Борисовна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Некрасова",
        houses: ["28","30","32","34"].map(num => ({ number: num, documents: [] })),
        jko: "Юг",
        jkoAddress: "г. Электрогорск, ул. Советская д. 7",
        jkoPhone: "8 (49643) 3-21-85",
        jkoChief: "Назарова Маргарита Борисовна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Кржижановского",
        houses: ["1","2","3","4","5","6","7","8","9","10","11","11а","29","31","32"].map(num => ({ number: num, documents: [] })),
        jko: "Юг",
        jkoAddress: "г. Электрогорск, ул. Советская д. 7",
        jkoPhone: "8 (49643) 3-21-85",
        jkoChief: "Назарова Маргарита Борисовна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Чкалова",
        houses: ["1","3"].map(num => ({ number: num, documents: [] })),
        jko: "Юг",
        jkoAddress: "г. Электрогорск, ул. Советская д. 7",
        jkoPhone: "8 (49643) 3-21-85",
        jkoChief: "Назарова Маргарита Борисовна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },

    // ===== ЖКО "СЕВЕР" =====
    {
        street: "ул. Безымянная",
        houses: ["10 корп. 1", "10 корп. 2", "12"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Ленина",
        houses: ["11","14а","15б","16","18","21","23","23а","24а","24б","25","29","33","36","37","38","39","41","44","46","47","48","54","55","56","58","59","60","61","63","64","66"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Классона",
        houses: ["1","2","3","4","5","6","7","8","9","10","11","12","13","14"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Пионерская",
        houses: ["1","3","3а","5","5а"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Калинина",
        houses: ["1","4","5","5а","13","14","15","17","18","19","21","23","37","39","41"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Комсомольская",
        houses: ["2","3","4","5","6а","7","8","9"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "пер. Комсомольский",
        houses: [
            { 
                number: "1", 
                documents: [
                    { name: "Отчёт по дому 1", link: "files/Пер. комсомольский 1.pdf" }
                ]
            },
            { 
                number: "2", 
                documents: [
                    { name: "Отчёт по дому 2 (часть 1)", link: "files/Пер. комсомольский 2.pdf" },
                    { name: "Отчёт по дому 2 (часть 2)", link: "files/Пер. комсомольский 3.pdf" }
                ]
            },
            { 
                number: "3", 
                documents: [] 
            }
        ],
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Семашко",
        houses: ["11"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. М. Горького",
        houses: ["1","1а","2","3","4","6","8","10","12","14","16","18","18а","26","27","28","31","33","34","35"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "пр. Жукова",
        houses: ["2/19"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    },
    {
        street: "ул. Ухтомского",
        houses: ["4","5","6","7","11","17","21"].map(num => ({ number: num, documents: [] })),
        jko: "Север",
        jkoAddress: "г. Электрогорск, ул. Карла Маркса д. 10 (1 этаж)",
        jkoPhone: "8 (49643) 3-16-21",
        jkoChief: "Щербакова Елена Михайловна",
        jkoHours: "пн.-пт. с 08:00 до 17:00, перерыв с 12:00 до 13:00, сб-вс выходной"
    }
];

// Общие номера для всех домов
const commonPhones = {
    emergency: "8 (49643) 3-11-76",
    uk: "+7 (49643) 3-10-42"
};

// Добавим общие телефоны в каждый объект улицы
housesData.forEach(item => {
    item.emergencyPhone = commonPhones.emergency;
    item.ukPhone = commonPhones.uk;
});